[MCM_GotchaAgainRedux_Settings]

sSettingsPage_Label = "Gotcha Again Redux"
sPageTitle_Label = "Gotcha Again Redux"

;GROUP 1    
sGroupUnitIndicators_Label = "Unit LOS Indicators"
bShowSquadsightHackingIndicator_Label = "Show squadsight hacking indicators"
bShowSquadsightHackingIndicator_Tip = "Show hacking indicators on units with Remote Hacking perks for units with clear LOS outside regular sight range."
bShowSquadsightGremlinIndicator_Label = "Show squadsight gremlin indicators"
bShowSquadsightGremlinIndicator_Tip = "Show indicators on units with Gremlin/Bit perks for units with clear LOS outside regular sight range."
bShowFriendlyLOSIndicators_Label = "Show friendly LOS indicators"
bShowFriendlyLOSIndicators_Tip = "Show LOS indicators for friendly units."
bShowVIPSpottedByEnemyIndicators_Label = "Show VIP spotted by enemy indicators"
bShowVIPSpottedByEnemyIndicators_Tip = "Show indicators for enemies that will spot a VIP being moved."
bShowLoneWolfIndicator_Label = "Show Max Lone Wolf indicator"
bShowLoneWolfIndicator_Tip = "Show indicator on the moving units UI Flag if Lone Wolf will be at maximum for destination tile. Requires LWotC/Compatible perks."

;GROUP 2
sGroupObjectiveIndicators_Label = "Object Indicators"
sIconPack_Label ="Icon Pack : dotvhs2"
SIconPack_Tip = "Select the icon pack to use for object indicators.\n This version only has 1 icon pack"
bShowTowerHackingArrows_Label = "Create ADVENT Tower Indicators"
bShowTowerHackingArrows_Tip = "Create tower indicators when an ADVENT tower is discovered, for indicating when hacking it is possible.\n Changing this will not fully take effect until the next tactical game."
bShowTowerHackingArrowsWithoutSight_Label = "Always Show ADVENT Tower indicators"
bShowTowerHackingArrowsWithoutSight_Tip = "Setting this will make the tower arrows show up even in the fog of war.\n Changing this will not fully take effect until the next tactical game."
bHideTowerArrowsAfterHacking_Label = "Hide tower indicators after hacking"
bHideTowerArrowsAfterHacking_Tip = "Remove the ADVENT tower indicators completely after they have been hacked instead of indicating hacking is no longer possible.\n Changing this will not fully take effect until the next tactical game."
bShowRemoteDoorHackingIndicators_Label = "Show indicator for remote hacking of doors"
bShowRemoteDoorHackingIndicators_Tip = "Shows the door hacking indicator for positions where hacking is possible using a Gremlin/Bit"

;GROUP 3
sGroupGrappleIndicators_Label = "Grapple Settings"
bShowLOSIndicatorsForGrappleDestinations_Label = "Show LOS indicators when using Grapple"
bShowLOSIndicatorsForGrappleDestinations_Tip = "Show LOS indicators when selecting a destination for Grapple perks."
bDisableHideObjectiveArrowsWhenUsingGrapple_Label = "Disable hiding object indicators"
bDisableHideObjectiveArrowsWhenUsingGrapple_Tip = "Disable hiding of object indicators when using Grapple perks."
bDisableDimHostileUnitFlagsWhenUsingGrapple_Label = "Disable dimming of unit flags"
bDisableDimHostileUnitFlagsWhenUsingGrapple_Tip = "Disable the dimming of hostile unit flags when using Grapple perks."

;GROUP 4
sGroupPathingIndicators_Label = "Waypoint Settings"
bUseCustomPathIndicatorSystem_Label = "Use custom waypoint path indicator system"
bUseCustomPathIndicatorSystem_Tip = "Use the custom Gotcha Again waypoint path indicator system instead of the native one.\n This is required to show the various new indicators along the movement path."
bShowOverwatchTriggers_Label = "Show Overwatch Trigger indicators"
bShowOverwatchTriggers_Tip = "Show indicators when an overwatch will be triggered."
bShowOverwatchTriggerForSuppression_Label = "Show Overwatch indicators for suppression"
bShowOverwatchTriggerForSuppression_Tip = "Show overwatch indicator for running a suppression."
bShowActivationTriggers_Label = "Show Pod Activation Trigger indicators"
bShowActivationTriggers_Tip = "Show indicators when an unactivated pod will be activated."
bShowNoiseIndicators_Label = "Show Noise indicators"
bShowNoiseIndicators_Tip = "Show indicators along the movement path where noise will be generated by breaking windows or kicking in doors."
bShowSmokeIndicator_Label = "Show Smoke indicators"
bShowSmokeIndicator_Tip = "Show an indicator for a tile if it is covered by smoke that offers a defensive bonus."
bShowDelayedDamageIndicator_Label = "Show Delayed Damage indicators"
bShowDelayedDamageIndicator_Tip = "Show an indicator for a tile if it is within the AOE of an active Delayed Damage effect, eg Psi-Bomb."
bShowHuntersMarkIndicator_Label = "Show Hunter's Mark indicators"
bShowHuntersMarkIndicator_Tip = "Show an indicator for a tile if it is within the range targeted by Hunter's Mark or enemy Kill Zone."

;GROUP 5
sGroupPeekFromConceal_Label = "Peek From Concealment Settings"
DisablePFC_Label = "Disable Peek From Concealment"
DisablePFC_Tip = "Master toggle to enable/disable PFC, checked [x] is disabled"
HideInHighCover_Label = "Allow High Cover Peek"
HideInHighCover_Tip = "When enabled, you can peek out of high cover without being detected."
HideWithHeightAdvantage_Label = "Allow Roof-Edge Peek"
HideWithHeightAdvantage_Tip = "When enabled, you cannot be detected in cover when you have height advantage.\n Allows you to approach the side of roofs, or skylights."
HideGroundMarkers_Label = "Hide Concealment Tile UI"
HideGroundMarkers_Tip = "Setting this on [x] will hide all concealment tile UI markers"
NumGraceTiles_Label = "Grace Tiles"
NumGraceTiles_Tip = "You can move through a few concealment-breaking tiles without being revealed"
ExtraDetectionRange_Label = "Enemy Bonus Detection Range"
ExtraDetectionRange_Tip = "If set > 0, this will buff detection ranges of all enemies by the specified amount of tiles.\n Requires game restart!"
MinEligibleDetectionRange_Label = "MinRange Before Bonus Added"
MinEligibleDetectionRange_Tip = "Minimum detection range required to get boosted by the previous parameter.  Used to exclude civillians basically"

;GROUP 6
sGroupMissClickProtection_Label = "Miss Click Protection Settings"
DisableMCP_Label = "Disable Miss Click Protection"
DisableMCP_Tip = "Master toggle to enable/disable MCP, checked [x] is disabled"
fAllowClickDelay_Label = "Click Delay in Seconds"
fAllowClickDelay_Tip = "Delay, in seconds, that determines how long your mouse has to hover above a tile before a unit is allowed to move there"
fCursorOpacity_ClickDisallowed_Label = "Delayed Puck Opacity %"
fCursorOpacity_ClickDisallowed_Tip = "Opacity of the mouse cursor while the delay timer is running."

;GROUP 7
sGroupCheats_Label = "CHEATS"
bAlwaysShowPodActivation_Label = "Unrevealed Pod Activation indicator"
bAlwaysShowPodActivation_Tip = "Always show pod activation indicator even for unrevealed enemies."

;GROUP 8
;sGroup_Label = bEnableLogging_Label
bEnableLogging_Label = "DEBUG Logging"
bEnableLogging_Tip = "Enable Logging of various things"
